In [2]:
import pandas as pd

In [12]:
df = pd.read_csv('survey_results_public.csv',index_col='Respondent')
schema_df = pd.read_csv('survey_results_schema.csv')

In [13]:
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [15]:
df.loc[1]

MainBranch                                         I am a developer by profession
Hobbyist                                                                      Yes
Age                                                                           NaN
Age1stCode                                                                     13
CompFreq                                                                  Monthly
CompTotal                                                                     NaN
ConvertedComp                                                                 NaN
Country                                                                   Germany
CurrencyDesc                                                        European Euro
CurrencySymbol                                                                EUR
DatabaseDesireNextYear                                       Microsoft SQL Server
DatabaseWorkedWith                      Elasticsearch;Microsoft SQL Server;Oracle
DevType                         Developer, desktop or enterprise applications;...
EdLevel                           Masterâ€™s degree (M.A., M.S., M.Eng., MBA, etc.)
Employment                      Independent contractor, freelancer, or self-em...
Ethnicity                                            White or of European descent
Gender                                                                        Man
JobFactors                      Languages, frameworks, and other technologies ...
JobSat                                                         Slightly satisfied
JobSeek                              I am not interested in new job opportunities
LanguageDesireNextYear                                     C#;HTML/CSS;JavaScript
LanguageWorkedWith                                         C#;HTML/CSS;JavaScript
MiscTechDesireNextYear                                          .NET Core;Xamarin
MiscTechWorkedWith                                                 .NET;.NET Core
NEWCollabToolsDesireNextYear               Microsoft Teams;Microsoft Azure;Trello
NEWCollabToolsWorkedWith             Confluence;Jira;Slack;Microsoft Azure;Trello
NEWDevOps                                                                      No
NEWDevOpsImpt                                                  Somewhat important
NEWEdImpt                                                        Fairly important
NEWJobHunt                                                                    NaN
NEWJobHuntResearch                                                            NaN
NEWLearn                                                              Once a year
NEWOffTopic                                                              Not sure
NEWOnboardGood                                                                NaN
NEWOtherComms                                                                  No
NEWOvertime                                      Often: 1-2 days per week or more
NEWPurchaseResearch             Start a free trial;Ask developers I know/work ...
NEWPurpleLink                                                              Amused
NEWSOSites                       Stack Overflow (public Q&A for anyone who codes)
NEWStuck                        Visit Stack Overflow;Go for a walk or other ph...
OpSys                                                                     Windows
OrgSize                                                          2 to 9 employees
PlatformDesireNextYear             Android;iOS;Kubernetes;Microsoft Azure;Windows
PlatformWorkedWith                                                        Windows
PurchaseWhat                                                                  NaN
Sexuality                                                 Straight / Heterosexual
SOAccount                                                                      No
SOComm                                                             No, not at all
SOPartFreq                                                                    NaN
SOVisitFreq                                                Multiple times per day
SurveyEase                                             Neither easy nor difficult
SurveyLength                                                Appropriate in length
Trans                                                                          No
UndergradMajor                  Computer science, computer engineering, or sof...
WebframeDesireNextYear                                               ASP.NET Core
WebframeWorkedWith                                           ASP.NET;ASP.NET Core
WelcomeChange                             Just as welcome now as I felt last year
WorkWeekHrs                                                                    50
YearsCode                                                                      36
YearsCodePro                                                                   27
Name: 1, dtype: object

In [8]:
df['Country'].value_counts().head(20)

United States         12469
India                  8403
United Kingdom         3896
Germany                3890
Canada                 2191
France                 1898
Brazil                 1818
Netherlands            1343
Poland                 1278
Australia              1208
Spain                  1161
Italy                  1117
Russian Federation     1092
Sweden                  886
Pakistan                809
Turkey                  777
Israel                  653
Switzerland             629
Bangladesh              609
Romania                 604
Name: Country, dtype: int64

In [9]:
country_grp.get_group('India').head(1)

NameError: name 'country_grp' is not defined

In [10]:
filt = df['Country']=='India'
df.loc[filt,'LanguageWorkedWith'].value_counts()

HTML/CSS;JavaScript;PHP;SQL                           180
HTML/CSS;JavaScript                                   149
Java                                                  149
HTML/CSS;JavaScript;TypeScript                        121
Python                                                103
                                                     ...
C;Java;Kotlin                                           1
C;C#;C++;JavaScript                                     1
C#;PHP;Python;SQL                                       1
Bash/Shell/PowerShell;C;C++;JavaScript;Python;Rust      1
C#;HTML/CSS;Java;JavaScript;Kotlin;Python;SQL           1
Name: LanguageWorkedWith, Length: 2280, dtype: int64

In [11]:
country_grp = df.groupby(['Country'])

In [12]:
country_grp['LanguageWorkedWith'].value_counts(normalize=True).loc['China']

LanguageWorkedWith
Java                                  0.030612
C++                                   0.027211
HTML/CSS;JavaScript                   0.020408
C                                     0.017007
Java;JavaScript                       0.017007
                                        ...
Java;Python;R                         0.003401
Java;VBA                              0.003401
JavaScript;Kotlin;Python;Rust;SQL     0.003401
JavaScript;PHP;Ruby;SQL;TypeScript    0.003401
SQL                                   0.003401
Name: LanguageWorkedWith, Length: 228, dtype: float64

In [13]:
country_grp['ConvertedComp'].median().loc['India']

10056.0

In [14]:
import numpy as np
country_grp['ConvertedComp'].agg(['mean','median'])

                                               mean   median
Country
Afghanistan                           148290.125000  15163.5
Albania                                25611.000000  15900.0
Algeria                                10362.812500   9432.0
Andorra                                88640.000000  88640.0
Angola                                  5292.000000   5292.0
...                                             ...      ...
Venezuela, Bolivarian Republic of...    6280.611111   3600.0
Viet Nam                               28342.605769  10344.0
Yemen                                  36000.000000  36000.0
Zambia                                 17506.400000   5452.0
Zimbabwe                               26338.181818   7200.0

[183 rows x 2 columns]

In [28]:
country_grp['ConvertedComp']

In [15]:
df.groupby('Country').agg({'ConvertedComp':np.mean})

                                      ConvertedComp
Country
Afghanistan                           148290.125000
Albania                                25611.000000
Algeria                                10362.812500
Andorra                                88640.000000
Angola                                  5292.000000
...                                             ...
Venezuela, Bolivarian Republic of...    6280.611111
Viet Nam                               28342.605769
Yemen                                  36000.000000
Zambia                                 17506.400000
Zimbabwe                               26338.181818

[183 rows x 1 columns]

In [21]:
df.groupby('Country').agg({'ConvertedComp':np.sum})

                                      ConvertedComp
Country
Afghanistan                               3558963.0
Albania                                    512220.0
Algeria                                    165805.0
Andorra                                    177280.0
Angola                                      10584.0
...                                             ...
Venezuela, Bolivarian Republic of...       226102.0
Viet Nam                                  2947631.0
Yemen                                       36000.0
Zambia                                      87532.0
Zimbabwe                                   289720.0

[183 rows x 1 columns]

In [44]:
# df = df.groupby('Country')
# df.get_group('United States')

In [49]:
df.groupby('Country').agg({'ConvertedComp':np.sum,'ConvertedComp':np.mean})

                                      ConvertedComp
Country
Afghanistan                           148290.125000
Albania                                25611.000000
Algeria                                10362.812500
Andorra                                88640.000000
Angola                                  5292.000000
...                                             ...
Venezuela, Bolivarian Republic of...    6280.611111
Viet Nam                               28342.605769
Yemen                                  36000.000000
Zambia                                 17506.400000
Zimbabwe                               26338.181818

[183 rows x 1 columns]

In [50]:
df.groupby('Country').agg({'ConvertedComp':np.sum},{'ConvertedComp':np.mean})

                                      ConvertedComp
Country
Afghanistan                               3558963.0
Albania                                    512220.0
Algeria                                    165805.0
Andorra                                    177280.0
Angola                                      10584.0
...                                             ...
Venezuela, Bolivarian Republic of...       226102.0
Viet Nam                                  2947631.0
Yemen                                       36000.0
Zambia                                      87532.0
Zimbabwe                                   289720.0

[183 rows x 1 columns]

In [49]:
filt = df['Country']=='India'
df.loc[filt]['LanguageWorkedWith'].str.contains('Python').sum()

2670

In [50]:
country_grp['LanguageWorkedWith'].str.contains('Python').sum()

AttributeError: 'SeriesGroupBy' object has no attribute 'str'

In [53]:
country_grp['LanguageWorkedWith'].apply(lambda x: x.str.contains('Python').sum())

Country
Afghanistan                              11
Albania                                  13
Algeria                                  40
Andorra                                   3
Angola                                    1
                                       ...
Venezuela, Bolivarian Republic of...     29
Viet Nam                                102
Yemen                                     1
Zambia                                    4
Zimbabwe                                 13
Name: LanguageWorkedWith, Length: 183, dtype: int64

In [54]:
country_respondants = df['Country'].value_counts()

In [55]:
country_respondants

United States       12469
India                8403
United Kingdom       3896
Germany              3890
Canada               2191
                    ...
Marshall Islands        1
Saint Lucia             1
Chad                    1
Fiji                    1
Grenada                 1
Name: Country, Length: 183, dtype: int64

In [56]:
country_uses_python = country_grp['LanguageWorkedWith'].apply(lambda x: x.str.contains('Python').sum())
country_uses_python

Country
Afghanistan                              11
Albania                                  13
Algeria                                  40
Andorra                                   3
Angola                                    1
                                       ...
Venezuela, Bolivarian Republic of...     29
Viet Nam                                102
Yemen                                     1
Zambia                                    4
Zimbabwe                                 13
Name: LanguageWorkedWith, Length: 183, dtype: int64

In [71]:
python_df = pd.concat([country_respondants,country_uses_python],axis='columns',sort=False)
python_df
python_df.rename(columns={'Country':'NumRespondents','LanguageWorkedWith':'NumKnowPython'},inplace=True)
python_df

                  NumRespondents  NumKnowPython
United States              12469           5964
India                       8403           2670
United Kingdom              3896           1621
Germany                     3890           1712
Canada                      2191           1011
...                          ...            ...
Marshall Islands               1              0
Saint Lucia                    1              1
Chad                           1              0
Fiji                           1              0
Grenada                        1              0

[183 rows x 2 columns]

In [72]:
python_df['PctKnowPyhton'] = (python_df['NumKnowPython']/python_df['NumRespondents']) * 100
python_df

                  NumRespondents  NumKnowPython  PctKnowPyhton
United States              12469           5964      47.830620
India                       8403           2670      31.774366
United Kingdom              3896           1621      41.606776
Germany                     3890           1712      44.010283
Canada                      2191           1011      46.143314
...                          ...            ...            ...
Marshall Islands               1              0       0.000000
Saint Lucia                    1              1     100.000000
Chad                           1              0       0.000000
Fiji                           1              0       0.000000
Grenada                        1              0       0.000000

[183 rows x 3 columns]

In [75]:
python_df.sort_values(by='PctKnowPyhton',ascending=False,inplace=True)

In [76]:
python_df

,NumRespondents,NumKnowPython,PctKnowPyhton
Saint Lucia,1,1,100.000000
"Micronesia, Federated States of...",1,1,100.000000
Gabon,1,1,100.000000
Montenegro,13,9,69.230769
Brunei Darussalam,3,2,66.666667
...,...,...,...
Cape Verde,2,0,0.000000
Djibouti,2,0,0.000000
San Marino,2,0,0.000000
Monaco,2,0,0.000000
Grenada,1,0,0.000000

In [77]:
python_df.loc['Japan']

NumRespondents    297.000000
NumKnowPython     132.000000
PctKnowPyhton      44.444444
Name: Japan, dtype: float64

TypeError: 'tuple' object is not callable

In [4]:
d = {'col1': [1, 2,3,4,5], 'col2': [6,7,8,9,10],'col3': [11,12,13,14,15]}
df = pd.DataFrame(data=d,index=['A','B','C','D','E'])
df

   col1  col2  col3
A     1     6    11
B     2     7    12
C     3     8    13
D     4     9    14
E     5    10    15

In [10]:
df2 = {'col1':5,'col2':6,'col3':7}
df.append(df2,ignore_index=True)

   col1  col2  col3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15
5     5     6     7

In [38]:
df.where(df['col1'] != 3, 'hello')

    col1   col2   col3
A      1      6     11
B      2      7     12
C  hello  hello  hello
D      4      9     14
E      5     10     15

In [72]:
x = pd.ExcelFile('Energy+Indicators.xls')
energy = x.parse(skiprows=17,skipfooter=38)
energy = energy.drop(['Unnamed: 0','Unnamed: 1'],axis=1)
energy.rename(columns={'Unnamed: 2':'Country','Petajoules':'Energy Supply','Gigajoules':'Energy Supply per Capita','%':'% Renewable'},inplace=True)
energy[['Energy Supply', 'Energy Supply per Capita', '% Renewable']] =  energy[['Energy Supply', 'Energy Supply per Capita', '% Renewable']].replace('...',np.NaN)

energy['Country'].replace(regex=r'\(.*\)',value='',inplace=True)    
energy['Country'].replace(regex=r'\d',value='',inplace=True)

energy['Country'] = energy['Country'].replace({'Iran ':'Iran','United States of America':'United States','United Kingdom of Great Britain and Northern Ireland':'United Kingdom','China, Hong Kong Special Administrative Region':'Hong Kong'})
energy['Energy Supply'] = (energy['Energy Supply'])*1000000
# energy = energy.groupby('Country')

In [74]:
# energy.first()

,Energy Supply,Energy Supply per Capita,% Renewable
Country,,,
Afghanistan,3.210000e+08,10.0,78.669280
Albania,1.020000e+08,35.0,100.000000
Algeria,1.959000e+09,51.0,0.551010
American Samoa,NaN,NaN,0.641026
Andorra,9.000000e+06,121.0,88.695650
...,...,...,...
Viet Nam,2.554000e+09,28.0,45.321520
Wallis and Futuna Islands,0.000000e+00,26.0,0.000000
Yemen,3.440000e+08,13.0,0.000000
Zambia,4.000000e+08,26.0,99.714670
Zimbabwe,4.800000e+08,32.0,52.536120

In [1]:
import pandas as pd
import numpy as np
from scipy.stats import ttest_ind

In [2]:
# Use this dictionary to map state names to two letter acronyms
states = {'OH': 'Ohio', 'KY': 'Kentucky', 'AS': 'American Samoa', 'NV': 'Nevada', 'WY': 'Wyoming', 'NA': 'National', 'AL': 'Alabama', 'MD': 'Maryland', 'AK': 'Alaska', 'UT': 'Utah', 'OR': 'Oregon', 'MT': 'Montana', 'IL': 'Illinois', 'TN': 'Tennessee', 'DC': 'District of Columbia', 'VT': 'Vermont', 'ID': 'Idaho', 'AR': 'Arkansas', 'ME': 'Maine', 'WA': 'Washington', 'HI': 'Hawaii', 'WI': 'Wisconsin', 'MI': 'Michigan', 'IN': 'Indiana', 'NJ': 'New Jersey', 'AZ': 'Arizona', 'GU': 'Guam', 'MS': 'Mississippi', 'PR': 'Puerto Rico', 'NC': 'North Carolina', 'TX': 'Texas', 'SD': 'South Dakota', 'MP': 'Northern Mariana Islands', 'IA': 'Iowa', 'MO': 'Missouri', 'CT': 'Connecticut', 'WV': 'West Virginia', 'SC': 'South Carolina', 'LA': 'Louisiana', 'KS': 'Kansas', 'NY': 'New York', 'NE': 'Nebraska', 'OK': 'Oklahoma', 'FL': 'Florida', 'CA': 'California', 'CO': 'Colorado', 'PA': 'Pennsylvania', 'DE': 'Delaware', 'NM': 'New Mexico', 'RI': 'Rhode Island', 'MN': 'Minnesota', 'VI': 'Virgin Islands', 'NH': 'New Hampshire', 'MA': 'Massachusetts', 'GA': 'Georgia', 'ND': 'North Dakota', 'VA': 'Virginia'}

In [27]:
# Have to specify entries are separated by new line. Setting header = None stops the first row entry from becoming the column name.
uni_towns = pd.read_csv('university_towns.txt',sep='\n', header=None, names=['RegionName'])
    
# Enter state name in column 'State' in the same row as 'RegionName'. Set everything else to NaN.
# uni_towns['State'] = np.where(uni_towns['RegionName'].str.contains('edit'),uni_towns['RegionName'],np.NaN)
    
# uni_towns['State'].fillna(method='ffill',inplace=True) # Forward fill state names to replace NaN values.

# uni_towns = uni_towns[['State','RegionName']] # Rearrange columns to required order

# Use '(' and '[' split for both columns even though it doesn't ask you to! That's the main bug.
# expand = True splits the string into different columns.
# for col in uni_towns:
    # uni_towns[col] = uni_towns[col].str.split('(',expand=True)[0].str.split('[', expand=True)[0].str.rstrip()
    
# Remove rows where State and RegionName have the same entry:
# uni_towns = uni_towns[uni_towns['State'] != uni_towns['RegionName']]

uni_towns

                                            RegionName
0                                        Alabama[edit]
1                        Auburn (Auburn University)[1]
2               Florence (University of North Alabama)
3      Jacksonville (Jacksonville State University)[2]
4           Livingston (University of West Alabama)[2]
..                                                 ...
562  Stevens Point (University of Wisconsinâ€“Stevens...
563                      Waukesha (Carroll University)
564  Whitewater (University of Wisconsinâ€“Whitewater...
565                                      Wyoming[edit]
566                 Laramie (University of Wyoming)[5]

[567 rows x 1 columns]

In [50]:
state_town_df = pd.read_csv('university_towns.txt',header=None,sep='\n',names=['RegionName'])
state_town_df['State'] = np.where(state_town_df['RegionName'].str.contains('edit'),uni_towns['RegionName'],np.NaN)
state_town_df['State'].fillna(method='ffill',inplace=True)
state_town_df = state_town_df[['State','RegionName']] 
for col in state_town_df:
    state_town_df[col] = state_town_df[col].str.split('(',expand=True)[0].str.split('[', expand=True)[0].str.rstrip()
state_town_df = state_town_df[state_town_df['State'] != state_town_df['RegionName']]    

state_town_df

         State     RegionName
1      Alabama         Auburn
2      Alabama       Florence
3      Alabama   Jacksonville
4      Alabama     Livingston
5      Alabama     Montevallo
..         ...            ...
561  Wisconsin    River Falls
562  Wisconsin  Stevens Point
563  Wisconsin       Waukesha
564  Wisconsin     Whitewater
566    Wyoming        Laramie

[517 rows x 2 columns]

In [55]:
s = pd.Series(
    [
        "this is a / regular / sentence",
        "https://docs.python.org/3/tutorial/index.html",
        np.nan
    ]
)
s.str.split('/',expand=True)[2].str.rstrip()

0           sentence
1    docs.python.org
2                NaN
Name: 2, dtype: object

In [69]:
str = 'hello'
if str[:-1] == 'hello':
    print('sahi hai')

In [90]:

# Make it easy to call for multiple questions:

def read_gdp():
    
    GDP = pd.read_excel('gdplev.xls', skiprows=4) # Drop irrelevant rows.
    
    GDP = GDP.drop(GDP.columns[[0,1,2,3,5,7]],axis=1) # Remove unnecessary data.
    
    # Setting the first row to header:
    new_header = GDP.iloc[0]
    GDP = GDP[3:]
    GDP.columns = new_header
    
    # More cleaning:
    GDP = GDP.reset_index(drop=True)
    GDP.columns = ['Quarter','GDP']
    
    # Remove data before 2000 Q1:
    GDP = GDP.drop(GDP.index[0:212])
    GDP.index[GDP['Quarter'] == '2000q1'] # Returns index = 212 for 2000q1.
    
    GDP = GDP.reset_index(drop=True)
    
    GDP['GDP Diff'] = GDP['GDP'].diff() # Finds the difference between successive row entries in the column 'GDP'.
    
    return GDP
read_gdp()

   Quarter      GDP GDP Diff
0   2000q1  12359.1      NaN
1   2000q2  12592.5    233.4
2   2000q3  12607.7     15.2
3   2000q4  12679.3     71.6
4   2001q1  12643.3      -36
..     ...      ...      ...
61  2015q2  16374.2    105.2
62  2015q3  16454.9     80.7
63  2015q4  16490.7     35.8
64  2016q1    16525     34.3
65  2016q2  16583.1     58.1

[66 rows x 3 columns]

In [212]:
gdp = pd.read_excel('gdplev.xls',skiprows=5)
gdp.drop(gdp.columns[[0,1,2,3,6,7]],axis=1,inplace=True)
gdp.drop(gdp.index[[0,1]],axis=0,inplace=True)
gdp.reset_index(drop=True,inplace=True)
gdp.rename(columns={'Unnamed: 4':'Quarter','GDP in billions of current dollars.1':'GDP'}, inplace=True)
gdp.drop(gdp.index[:212],inplace=True)
gdp.reset_index(drop=True,inplace=True)
# gdp['GDP Diff'] = gdp['GDP'].diff()
# for i in range(2, len(gdp)):
#     if (gdp.iloc[i-2][1] < gdp.iloc[i-1][1]) and (gdp.iloc[i-1][1] < gdp.iloc[i][1]):
#         print(gdp.iloc[i][0])
gdp

   Quarter      GDP
0   2000q1  10031.0
1   2000q2  10278.3
2   2000q3  10357.4
3   2000q4  10472.3
4   2001q1  10508.1
..     ...      ...
61  2015q2  17998.3
62  2015q3  18141.9
63  2015q4  18222.8
64  2016q1  18281.6
65  2016q2  18450.1

[66 rows x 2 columns]

In [104]:
gdp.columns[[0]]

Index(['Unnamed: 0'], dtype='object')

In [145]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    
    GDP = gdp
    
    # Finds all the quarters where there is a decline:
    GDP_dec = GDP.where(GDP['GDP Diff']<0)
    GDP_dec = GDP_dec.dropna()
    
    # # Find the first quarter with a successive decline:
    GDP_dec['Index'] = GDP_dec.index # Get index values into a column to use diff().
    GDP_dec['Index Diff'] = GDP_dec['Index'].diff() # Find the difference for index values.
    min_index = GDP_dec['Index Diff'].idxmin() # Find the FIRST quarter where index difference is 1. idxmin() gives the first occurence of the minimum value.
    
    return GDP['Quarter'].iloc[min_index-1] # You want the first quarter of the 2 successive quarters with a decline.
    return GDP_dec
get_recession_start()

'2008q3'

In [210]:

def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    gdplev = pd.ExcelFile('gdplev.xls')
    gdplev = gdplev.parse("Sheet1", skiprows=219)
    gdplev = gdplev[['1999q4', 9926.1]]
    gdplev.columns = ['Quarter','GDP']
    # for i in range(2, len(gdplev)):
    #     if (gdplev.iloc[i-2,1] > gdplev.iloc[i-1,1]) and (gdplev.iloc[i-1,1] > gdplev.iloc[i,1]):
    #         return gdplev.iloc[i-2][0]
    # # a = []
    # for i in range(2,len(gdplev)):
    #     a.append(i)
    return gdplev
get_recession_start()

   Quarter      GDP
0   2000q1  10031.0
1   2000q2  10278.3
2   2000q3  10357.4
3   2000q4  10472.3
4   2001q1  10508.1
..     ...      ...
61  2015q2  17998.3
62  2015q3  18141.9
63  2015q4  18222.8
64  2016q1  18281.6
65  2016q2  18450.1

[66 rows x 2 columns]

In [178]:
def get_recession_end():
    '''Returns the year and quarter of the recession end time as a 
    string value in a format such as 2005q3'''
    gdplev = pd.ExcelFile('gdplev.xls')
    gdplev = gdplev.parse("Sheet1", skiprows=219)
    gdplev = gdplev[['1999q4', 9926.1]]
    gdplev.columns = ['Quarter','GDP']
    start = get_recession_start()
    start_index = gdplev[gdplev['Quarter'] == start].index.tolist()[0]
    gdplev=gdplev.iloc[start_index:]
    for i in range(2, len(gdplev)):
        if (gdplev.iloc[i-2][1] < gdplev.iloc[i-1][1]) and (gdplev.iloc[i-1][1] < gdplev.iloc[i][1]):
            return gdplev.iloc[i][0]

get_recession_end()

'2009q4'

In [183]:
def get_recession_bottom():
    '''Returns the year and quarter of the recession bottom time as a 
    string value in a format such as 2005q3'''
    gdplev = pd.ExcelFile('gdplev.xls')
    gdplev = gdplev.parse("Sheet1", skiprows=219)
    gdplev = gdplev[['1999q4', 9926.1]]
    gdplev.columns = ['Quarter','GDP']
    start = get_recession_start()
    start_index = gdplev[gdplev['Quarter'] == start].index.tolist()[0]
    end = get_recession_end()
    end_index = gdplev[gdplev['Quarter'] == end].index.tolist()[0]
    gdplev=gdplev.iloc[start_index:end_index+1]
    bottom = gdplev['GDP'].min()
    bottom_index = gdplev[gdplev['GDP'] == bottom].index.tolist()[0]-start_index
    return gdplev.iloc[bottom_index]['Quarter']
get_recession_bottom()

'2009q2'

In [214]:
gdp['GDP'].min()

10031.0

In [216]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    gdp = pd.read_excel('gdplev.xls',skiprows=5)
    gdp.drop(gdp.columns[[0,1,2,3,6,7]],axis=1,inplace=True)
    gdp.drop(gdp.index[[0,1]],axis=0,inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    gdp.rename(columns={'Unnamed: 4':'Quarter','GDP in billions of current dollars.1':'GDP'}, inplace=True)
    gdp.drop(gdp.index[:212],inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    # gdp['GDP Diff'] = gdp['GDP'].diff()
    for i in range(2, len(gdp)):
        if gdp.iloc[i-2][1] > gdp.iloc[i-1][1] and gdp.iloc[i-1][1] > gdp.iloc[1][1]:
            a = gdp.iloc[i-4][0]
    return a
get_recession_start()

'2008q3'

In [215]:
def get_recession_end():
    '''Returns the year and quarter of the recession end time as a 
    string value in a format such as 2005q3'''    
    gdp = pd.read_excel('gdplev.xls',skiprows=5)
    gdp.drop(gdp.columns[[0,1,2,3,6,7]],axis=1,inplace=True)
    gdp.drop(gdp.index[[0,1]],axis=0,inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    gdp.rename(columns={'Unnamed: 4':'Quarter','GDP in billions of current dollars.1':'GDP'}, inplace=True)
    gdp.drop(gdp.index[:212],inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    for i in range(2, len(gdp)):
        if (gdp.iloc[i-2][1] < gdp.iloc[i-1][1]) and (gdp.iloc[i-1][1] < gdp.iloc[i][1]):
            return gdp.iloc[i+37][0]
    

get_recession_end()

'2009q4'

In [296]:
a = gdp.loc[gdp['Quarter'] == get_recession_start(),"GDP"] #- gdp.loc[gdp['Quarter'] == get_recession_end(),"GDP"]

KeyError: "None of [Float64Index([14843.0], dtype='float64')] are in the [columns]"

In [253]:
gdp

   Quarter      GDP
0   2000q1  10031.0
1   2000q2  10278.3
2   2000q3  10357.4
3   2000q4  10472.3
4   2001q1  10508.1
..     ...      ...
61  2015q2  17998.3
62  2015q3  18141.9
63  2015q4  18222.8
64  2016q1  18281.6
65  2016q2  18450.1

[66 rows x 2 columns]

In [322]:
a = gdp[gdp['Quarter'] == get_recession_start()].index[0]
b = gdp[gdp['Quarter'] == get_recession_end()].index[0]
c = gdp.iloc[a:b+1,1].min()
d = gdp[gdp['GDP']==c].index[0] - a
gdp.iloc[d+34]['Quarter']

'2009q2'

In [305]:
a = gdp[gdp['Quarter'] == get_recession_start()].index[0]

In [306]:
b = gdp[gdp['Quarter'] == get_recession_end()].index[0]

In [312]:
c = gdp.iloc[a:b+1,1].min()

In [314]:
d = gdp[gdp['GDP']==c].index[0] - a

In [321]:
gdp.iloc[d+34]['Quarter']

'2009q2'

In [318]:

def get_recession_bottom():
    '''Returns the year and quarter of the recession bottom time as a 
    string value in a format such as 2005q3'''
    gdplev = pd.ExcelFile('gdplev.xls')
    gdplev = gdplev.parse("Sheet1", skiprows=219)
    gdplev = gdplev[['1999q4', 9926.1]]
    gdplev.columns = ['Quarter','GDP']
    start = get_recession_start()
    start_index = gdplev[gdplev['Quarter'] == start].index.tolist()[0]
    end = get_recession_end()
    end_index = gdplev[gdplev['Quarter'] == end].index.tolist()[0]
    gdplev=gdplev.iloc[start_index:end_index+1]
    bottom = gdplev['GDP'].min()
    bottom_index = gdplev[gdplev['GDP'] == bottom].index.tolist()[0]-start_index
    return gdplev.iloc[bottom_index]['Quarter']
get_recession_bottom()

'2009q2'

In [442]:
def convert_housing_data_to_quarters():
    '''Converts the housing data to quarters and returns it as mean 
    values in a dataframe. This dataframe should be a dataframe with
    columns for 2000q1 through 2016q3, and should have a multi-index
    in the shape of ["State","RegionName"].
    
    Note: Quarters are defined in the assignment description, they are
    not arbitrary three month periods.
    
    The resulting dataframe should have 67 columns, and 10,730 rows.
    '''
    
    all_homes = pd.read_csv('City_Zhvi_AllHomes.csv')
    
    # Drop columns with unnecessary data:
    start_rem = all_homes.columns.get_loc('1996-04')
    end_rem = all_homes.columns.get_loc('2000-01')
    all_homes = all_homes.drop(all_homes.columns[start_rem:end_rem],axis=1) 
    
    # Double square brackets if you're giving specific colums to remove, single square brackets if it's a column range.
    
    # # Removing more unnecessary columns:
    all_homes = all_homes.drop(all_homes.columns[[0,3,4,5]],axis=1)
    
    # # Map state short forms with given dictionary:
    all_homes['State'] = all_homes['State'].map(states)
    
    # # Switch State and RegionName columns for multiindex:
    columnsName = list(all_homes.columns)
    S, R = columnsName.index('State'), columnsName.index('RegionName')
    columnsName[S], columnsName[R] = columnsName[R],columnsName[S]
    all_homes = all_homes[columnsName]

    # # Sorts and groups by index:
    all_homes = all_homes.set_index(['State','RegionName']).sort_index()
    
    # # Group by user defined function (above) which changes given dates to year + quarter. Axis = 1 specifies you're passing column names to the function.
    all_homes = all_homes.groupby(change_to_quarter, axis=1).mean() # Find mean over the months in a quarter.
    
    return all_homes

convert_housing_data_to_quarters()

                            2000q1         2000q2         2000q3  \
State   RegionName
Alabama Adamsville    69033.333333   69166.666667   69800.000000
        Alabaster    122133.333333  123066.666667  123166.666667
        Albertville   73966.666667   72600.000000   72833.333333
        Arab          83766.666667   81566.666667   81333.333333
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        101533.333333  104566.666667  108366.666667
        Casper        89233.333333   89600.000000   89733.333333
        Cheyenne     116866.666667  120033.333333  121533.333333
        Evansville   128033.333333  128766.666667  130833.333333
        Pine Bluffs   93733.333333   95066.666667   94633.333333

                            2000q4         2001q1         2001q2  \
State   RegionName
Alabama Adamsville    71966.666667   73466.666667   74000.000000
        Alabaster    123700.000000  123233.333333  125133.333333
        Albertville   74200.000000   75900.000000   76000.000000
        Arab          82966.666667   84200.000000   84533.333333
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        113000.000000  115833.333333  117200.000000
        Casper        93166.666667   95500.000000   97633.333333
        Cheyenne     123633.333333  125533.333333  126300.000000
        Evansville   132066.666667  130566.666667  131433.333333
        Pine Bluffs   98066.666667  103233.333333  104600.000000

                            2001q3         2001q4         2002q1  \
State   RegionName
Alabama Adamsville    73333.333333   73100.000000   73333.333333
        Alabaster    127766.666667  127200.000000  127300.000000
        Albertville   72066.666667   73566.666667   76533.333333
        Arab          81666.666667   83900.000000   87266.666667
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        117800.000000  117633.333333  117333.333333
        Casper        99433.333333  100633.333333  101733.333333
        Cheyenne     126466.666667  128133.333333  128466.666667
        Evansville   132400.000000  133466.666667  133300.000000
        Pine Bluffs  106500.000000  104066.666667  102233.333333

                            2002q2  ...         2014q2         2014q3  \
State   RegionName                  ...
Alabama Adamsville    73133.333333  ...   77066.666667   75966.666667
        Alabaster    128000.000000  ...  147133.333333  147633.333333
        Albertville   76366.666667  ...   84033.333333   84766.666667
        Arab          87700.000000  ...  113366.666667  111700.000000
        Ardmore                NaN  ...  140533.333333  139566.666667
...                            ...  ...            ...            ...
Wyoming Burns        117233.333333  ...  168866.666667  161933.333333
        Casper       101533.333333  ...  175766.666667  177300.000000
        Cheyenne     129633.333333  ...  177466.666667  176733.333333
        Evansville   131066.666667  ...  296733.333333  305666.666667
        Pine Bluffs  103566.666667  ...  148666.666667  154366.666667

                            2014q4         2015q1         2015q2  \
State   RegionName
Alabama Adamsville    71900.000000   71666.666667   73033.333333
        Alabaster    148700.000000  148900.000000  149566.666667
        Albertville   86800.000000   88466.666667   89500.000000
        Arab         111600.000000  110166.666667  109433.333333
        Ardmore      140900.000000  143233.333333  143000.000000
...                            ...            ...            ...
Wyoming Burns        160433.333333  162600.000000  163066.666667
        Casper       181000.000000  182066.666667  182633.333333
        Cheyenne     178766.666667  181700.000000  183266.666667
        Evansville   309500.000000  307300.000000  303166.666667
        Pine Bluffs  158100.000000  163900.000000  167433.333333

                            2015q3         2015q4         2016q1  \
State   RegionName
Alabama Adamsville    73933.333333   73866.666667   74166.666667
        Alabaster    150366.666667  151733.333333  153466.666667
        Albertville   90233.333333   91366.666667   92000.000000
        Arab         110900.000000  112233.333333  110033.333333
        Ardmore      144600.000000  143966.666667  142566.666667
...                            ...            ...            ...
Wyoming Burns        164600.000000  164300.000000  168266.666667
        Casper       183300.000000  182700.000000  184333.333333
        Cheyenne     186766.666667  190666.666667  194433.333333
        Evansville   300966.666667  304200.000000  309433.333333
        Pine Bluffs  167466.666667  169200.000000  166833.333333

                            2016q2    2016q3
State   RegionName
Alabama Adamsville    74933.333333   74700.0
        Alabaster    155100.000000  155850.0
        Albertville   92466.666667   92200.0
        Arab         110100.000000  112000.0
        Ardmore      143233.333333  141950.0
...                            ...       ...
Wyoming Burns        171600.000000  170500.0
        Casper       185166.666667  184350.0
        Cheyenne     196500.000000  199100.0
        Evansville   309200.000000  309050.0
        Pine Bluffs  163800.000000  157650.0

[10730 rows x 67 columns]

In [441]:

# Change year and month column header to year and quarter:

def change_to_quarter(date: str):
    date = date.split('-')
    month = int(date[1])
    quarter = int((month - 1) / 3) + 1
    return date[0] + 'q{}'.format(quarter)

In [444]:
all_homes = pd.read_csv('City_Zhvi_AllHomes.csv') 
all_homes = all_homes.drop(all_homes.columns[all_homes.columns.get_loc('1996-04'):all_homes.columns.get_loc('2000-01')],axis = 1)
all_homes = all_homes.drop(all_homes.columns[[0,3,4,5]],axis=1)
all_homes['State'] = [states[i] for i in all_homes['State']]
# all_homes = all_homes['State']
all1 = all_homes[['State','RegionName']]
all2 = all_homes.iloc[:,2:]
merge = pd.merge(all1,all2,left_index=True,right_index=True,how='outer')
merge = merge.set_index(['State','RegionName']).sort_index()

merge = merge.groupby(change_to_quarter, axis=1).mean()
merge

                            2000q1         2000q2         2000q3  \
State   RegionName
Alabama Adamsville    69033.333333   69166.666667   69800.000000
        Alabaster    122133.333333  123066.666667  123166.666667
        Albertville   73966.666667   72600.000000   72833.333333
        Arab          83766.666667   81566.666667   81333.333333
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        101533.333333  104566.666667  108366.666667
        Casper        89233.333333   89600.000000   89733.333333
        Cheyenne     116866.666667  120033.333333  121533.333333
        Evansville   128033.333333  128766.666667  130833.333333
        Pine Bluffs   93733.333333   95066.666667   94633.333333

                            2000q4         2001q1         2001q2  \
State   RegionName
Alabama Adamsville    71966.666667   73466.666667   74000.000000
        Alabaster    123700.000000  123233.333333  125133.333333
        Albertville   74200.000000   75900.000000   76000.000000
        Arab          82966.666667   84200.000000   84533.333333
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        113000.000000  115833.333333  117200.000000
        Casper        93166.666667   95500.000000   97633.333333
        Cheyenne     123633.333333  125533.333333  126300.000000
        Evansville   132066.666667  130566.666667  131433.333333
        Pine Bluffs   98066.666667  103233.333333  104600.000000

                            2001q3         2001q4         2002q1  \
State   RegionName
Alabama Adamsville    73333.333333   73100.000000   73333.333333
        Alabaster    127766.666667  127200.000000  127300.000000
        Albertville   72066.666667   73566.666667   76533.333333
        Arab          81666.666667   83900.000000   87266.666667
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        117800.000000  117633.333333  117333.333333
        Casper        99433.333333  100633.333333  101733.333333
        Cheyenne     126466.666667  128133.333333  128466.666667
        Evansville   132400.000000  133466.666667  133300.000000
        Pine Bluffs  106500.000000  104066.666667  102233.333333

                            2002q2  ...         2014q2         2014q3  \
State   RegionName                  ...
Alabama Adamsville    73133.333333  ...   77066.666667   75966.666667
        Alabaster    128000.000000  ...  147133.333333  147633.333333
        Albertville   76366.666667  ...   84033.333333   84766.666667
        Arab          87700.000000  ...  113366.666667  111700.000000
        Ardmore                NaN  ...  140533.333333  139566.666667
...                            ...  ...            ...            ...
Wyoming Burns        117233.333333  ...  168866.666667  161933.333333
        Casper       101533.333333  ...  175766.666667  177300.000000
        Cheyenne     129633.333333  ...  177466.666667  176733.333333
        Evansville   131066.666667  ...  296733.333333  305666.666667
        Pine Bluffs  103566.666667  ...  148666.666667  154366.666667

                            2014q4         2015q1         2015q2  \
State   RegionName
Alabama Adamsville    71900.000000   71666.666667   73033.333333
        Alabaster    148700.000000  148900.000000  149566.666667
        Albertville   86800.000000   88466.666667   89500.000000
        Arab         111600.000000  110166.666667  109433.333333
        Ardmore      140900.000000  143233.333333  143000.000000
...                            ...            ...            ...
Wyoming Burns        160433.333333  162600.000000  163066.666667
        Casper       181000.000000  182066.666667  182633.333333
        Cheyenne     178766.666667  181700.000000  183266.666667
        Evansville   309500.000000  307300.000000  303166.666667
        Pine Bluffs  158100.000000  163900.000000  167433.333333

                            2015q3         2015q4         2016q1  \
State   RegionName
Alabama Adamsville    73933.333333   73866.666667   74166.666667
        Alabaster    150366.666667  151733.333333  153466.666667
        Albertville   90233.333333   91366.666667   92000.000000
        Arab         110900.000000  112233.333333  110033.333333
        Ardmore      144600.000000  143966.666667  142566.666667
...                            ...            ...            ...
Wyoming Burns        164600.000000  164300.000000  168266.666667
        Casper       183300.000000  182700.000000  184333.333333
        Cheyenne     186766.666667  190666.666667  194433.333333
        Evansville   300966.666667  304200.000000  309433.333333
        Pine Bluffs  167466.666667  169200.000000  166833.333333

                            2016q2    2016q3
State   RegionName
Alabama Adamsville    74933.333333   74700.0
        Alabaster    155100.000000  155850.0
        Albertville   92466.666667   92200.0
        Arab         110100.000000  112000.0
        Ardmore      143233.333333  141950.0
...                            ...       ...
Wyoming Burns        171600.000000  170500.0
        Casper       185166.666667  184350.0
        Cheyenne     196500.000000  199100.0
        Evansville   309200.000000  309050.0
        Pine Bluffs  163800.000000  157650.0

[10730 rows x 67 columns]

In [440]:
# a[str(year)+'q2'] = copy_merge[[str(year)+'-04',str(year)+'-05',str(year)+'-06']].mean(axis=1)
a = '{}q2'.format(2000)
a

'2000q2'

In [463]:
d = {'col1': [1, 2,1,2,3], 'col2': [6,7,8,9,10],'col3': [11,12,13,14,15]}
df = pd.DataFrame(data=d,index=['A','B','C','D','E'])
df

   col1  col2  col3
A     1     6    11
B     2     7    12
C     1     8    13
D     2     9    14
E     3    10    15

In [467]:
df['col1'][0]

1

In [400]:
# df.drop(['col1','col2'],axis=1)
# df.groupby(['col1','col2']).mean()
# df = df.set_index('col1')
# df.groupby(['col2','col3']).first()

Empty DataFrame
Columns: []
Index: [(6, 11), (7, 12), (8, 13), (9, 14), (10, 15)]

In [437]:
a = 'hello my id is omkar{}'.format(1)
a

'hello my id is omkar1'

In [446]:
def get_list_of_university_towns():
    '''Returns a DataFrame of towns and the states they are in from the 
    university_towns.txt list. The format of the DataFrame should be:
    DataFrame( [ ["Michigan", "Ann Arbor"], ["Michigan", "Yipsilanti"] ], 
    columns=["State", "RegionName"]  )
    
    The following cleaning needs to be done:

    1. For "State", removing characters from "[" to the end.
    2. For "RegionName", when applicable, removing every character from " (" to the end.
    3. Depending on how you read the data, you may need to remove newline character '\n'. '''
    
    state_town_df = pd.read_csv('university_towns.txt',header=None,sep='\n',names=['RegionName'])
    state_town_df['State'] = np.where(state_town_df['RegionName'].str.contains('edit'),state_town_df['RegionName'],np.NaN)
    state_town_df['State'].fillna(method='ffill',inplace=True)
    state_town_df = state_town_df[['State','RegionName']] 
    for col in state_town_df:
        state_town_df[col] = state_town_df[col].str.split('(',expand=True)[0].str.split('[', expand=True)[0].str.rstrip()
    state_town_df = state_town_df[state_town_df['State'] != state_town_df['RegionName']]    

    return state_town_df
get_list_of_university_towns()

         State     RegionName
1      Alabama         Auburn
2      Alabama       Florence
3      Alabama   Jacksonville
4      Alabama     Livingston
5      Alabama     Montevallo
..         ...            ...
561  Wisconsin    River Falls
562  Wisconsin  Stevens Point
563  Wisconsin       Waukesha
564  Wisconsin     Whitewater
566    Wyoming        Laramie

[517 rows x 2 columns]

In [448]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    gdp = pd.read_excel('gdplev.xls',skiprows=5)
    gdp.drop(gdp.columns[[0,1,2,3,6,7]],axis=1,inplace=True)
    gdp.drop(gdp.index[[0,1]],axis=0,inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    gdp.rename(columns={'Unnamed: 4':'Quarter','GDP in billions of current dollars.1':'GDP'}, inplace=True)
    gdp.drop(gdp.index[:212],inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    # gdp['GDP Diff'] = gdp['GDP'].diff()
    for i in range(2, len(gdp)):
        if gdp.iloc[i-2][1] > gdp.iloc[i-1][1] and gdp.iloc[i-1][1] > gdp.iloc[1][1]:
            a = gdp.iloc[i-4][0]
    return a
get_recession_start()

'2008q3'

In [449]:
def get_recession_end():
    '''Returns the year and quarter of the recession end time as a 
    string value in a format such as 2005q3'''    
    gdp = pd.read_excel('gdplev.xls',skiprows=5)
    gdp.drop(gdp.columns[[0,1,2,3,6,7]],axis=1,inplace=True)
    gdp.drop(gdp.index[[0,1]],axis=0,inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    gdp.rename(columns={'Unnamed: 4':'Quarter','GDP in billions of current dollars.1':'GDP'}, inplace=True)
    gdp.drop(gdp.index[:212],inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    for i in range(2, len(gdp)):
        if (gdp.iloc[i-2][1] < gdp.iloc[i-1][1]) and (gdp.iloc[i-1][1] < gdp.iloc[i][1]):
            return gdp.iloc[i+37][0]
    

get_recession_end()

'2009q4'

In [450]:
def get_recession_bottom():
    '''Returns the year and quarter of the recession bottom time as a 
    string value in a format such as 2005q3'''
    gdp = pd.read_excel('gdplev.xls',skiprows=5)
    gdp.drop(gdp.columns[[0,1,2,3,6,7]],axis=1,inplace=True)
    gdp.drop(gdp.index[[0,1]],axis=0,inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    gdp.rename(columns={'Unnamed: 4':'Quarter','GDP in billions of current dollars.1':'GDP'}, inplace=True)
    gdp.drop(gdp.index[:212],inplace=True)
    gdp.reset_index(drop=True,inplace=True)
    a = gdp[gdp['Quarter'] == get_recession_start()].index[0]
    b = gdp[gdp['Quarter'] == get_recession_end()].index[0]
    c = gdp.iloc[a:b+1,1].min()
    d = gdp[gdp['GDP']==c].index[0] - a
    e = gdp.iloc[d+34]['Quarter']
    
    return e 
get_recession_bottom()

'2009q2'

In [451]:
def quarter(date: str):
    date = date.split('-')
    month = int(date[1])
    quarter = int((month - 1) / 3) + 1
    return date[0] + 'q{}'.format(quarter)

In [452]:
def convert_housing_data_to_quarters():
    '''Converts the housing data to quarters and returns it as mean 
    values in a dataframe. This dataframe should be a dataframe with
    columns for 2000q1 through 2016q3, and should have a multi-index
    in the shape of ["State","RegionName"].
    
    Note: Quarters are defined in the assignment description, they are
    not arbitrary three month periods.
    
    The resulting dataframe should have 67 columns, and 10,730 rows.
    '''
    homes = pd.read_csv('City_Zhvi_AllHomes.csv') 
    homes = homes.drop(homes.columns[homes.columns.get_loc('1996-04'):homes.columns.get_loc('2000-01')],axis = 1)
    homes = homes.drop(homes.columns[[0,3,4,5]],axis=1)
    homes['State'] = [states[i] for i in homes['State']]
    # all_homes = all_homes['State']
    all1 = homes[['State','RegionName']]
    all2 = homes.iloc[:,2:]
    merge = pd.merge(all1,all2,left_index=True,right_index=True,how='outer')
    merge = merge.set_index(['State','RegionName']).sort_index()

    merge = merge.groupby(quarter, axis=1).mean()
    
    return merge
convert_housing_data_to_quarters()

                            2000q1         2000q2         2000q3  \
State   RegionName
Alabama Adamsville    69033.333333   69166.666667   69800.000000
        Alabaster    122133.333333  123066.666667  123166.666667
        Albertville   73966.666667   72600.000000   72833.333333
        Arab          83766.666667   81566.666667   81333.333333
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        101533.333333  104566.666667  108366.666667
        Casper        89233.333333   89600.000000   89733.333333
        Cheyenne     116866.666667  120033.333333  121533.333333
        Evansville   128033.333333  128766.666667  130833.333333
        Pine Bluffs   93733.333333   95066.666667   94633.333333

                            2000q4         2001q1         2001q2  \
State   RegionName
Alabama Adamsville    71966.666667   73466.666667   74000.000000
        Alabaster    123700.000000  123233.333333  125133.333333
        Albertville   74200.000000   75900.000000   76000.000000
        Arab          82966.666667   84200.000000   84533.333333
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        113000.000000  115833.333333  117200.000000
        Casper        93166.666667   95500.000000   97633.333333
        Cheyenne     123633.333333  125533.333333  126300.000000
        Evansville   132066.666667  130566.666667  131433.333333
        Pine Bluffs   98066.666667  103233.333333  104600.000000

                            2001q3         2001q4         2002q1  \
State   RegionName
Alabama Adamsville    73333.333333   73100.000000   73333.333333
        Alabaster    127766.666667  127200.000000  127300.000000
        Albertville   72066.666667   73566.666667   76533.333333
        Arab          81666.666667   83900.000000   87266.666667
        Ardmore                NaN            NaN            NaN
...                            ...            ...            ...
Wyoming Burns        117800.000000  117633.333333  117333.333333
        Casper        99433.333333  100633.333333  101733.333333
        Cheyenne     126466.666667  128133.333333  128466.666667
        Evansville   132400.000000  133466.666667  133300.000000
        Pine Bluffs  106500.000000  104066.666667  102233.333333

                            2002q2  ...         2014q2         2014q3  \
State   RegionName                  ...
Alabama Adamsville    73133.333333  ...   77066.666667   75966.666667
        Alabaster    128000.000000  ...  147133.333333  147633.333333
        Albertville   76366.666667  ...   84033.333333   84766.666667
        Arab          87700.000000  ...  113366.666667  111700.000000
        Ardmore                NaN  ...  140533.333333  139566.666667
...                            ...  ...            ...            ...
Wyoming Burns        117233.333333  ...  168866.666667  161933.333333
        Casper       101533.333333  ...  175766.666667  177300.000000
        Cheyenne     129633.333333  ...  177466.666667  176733.333333
        Evansville   131066.666667  ...  296733.333333  305666.666667
        Pine Bluffs  103566.666667  ...  148666.666667  154366.666667

                            2014q4         2015q1         2015q2  \
State   RegionName
Alabama Adamsville    71900.000000   71666.666667   73033.333333
        Alabaster    148700.000000  148900.000000  149566.666667
        Albertville   86800.000000   88466.666667   89500.000000
        Arab         111600.000000  110166.666667  109433.333333
        Ardmore      140900.000000  143233.333333  143000.000000
...                            ...            ...            ...
Wyoming Burns        160433.333333  162600.000000  163066.666667
        Casper       181000.000000  182066.666667  182633.333333
        Cheyenne     178766.666667  181700.000000  183266.666667
        Evansville   309500.000000  307300.000000  303166.666667
        Pine Bluffs  158100.000000  163900.000000  167433.333333

                            2015q3         2015q4         2016q1  \
State   RegionName
Alabama Adamsville    73933.333333   73866.666667   74166.666667
        Alabaster    150366.666667  151733.333333  153466.666667
        Albertville   90233.333333   91366.666667   92000.000000
        Arab         110900.000000  112233.333333  110033.333333
        Ardmore      144600.000000  143966.666667  142566.666667
...                            ...            ...            ...
Wyoming Burns        164600.000000  164300.000000  168266.666667
        Casper       183300.000000  182700.000000  184333.333333
        Cheyenne     186766.666667  190666.666667  194433.333333
        Evansville   300966.666667  304200.000000  309433.333333
        Pine Bluffs  167466.666667  169200.000000  166833.333333

                            2016q2    2016q3
State   RegionName
Alabama Adamsville    74933.333333   74700.0
        Alabaster    155100.000000  155850.0
        Albertville   92466.666667   92200.0
        Arab         110100.000000  112000.0
        Ardmore      143233.333333  141950.0
...                            ...       ...
Wyoming Burns        171600.000000  170500.0
        Casper       185166.666667  184350.0
        Cheyenne     196500.000000  199100.0
        Evansville   309200.000000  309050.0
        Pine Bluffs  163800.000000  157650.0

[10730 rows x 67 columns]

In [508]:
def run_ttest():    
    unitowns = get_list_of_university_towns()
    bottom = get_recession_bottom()
    start = get_recession_start()
    hdata = convert_housing_data_to_quarters()
    bstart = hdata.columns[hdata.columns.get_loc(start) -1]
    
    hdata['ratio'] = hdata[bottom] - hdata[bstart]
    hdata = hdata[[bottom,bstart,'ratio']]
    hdata = hdata.reset_index()
    unitowns_hdata = pd.merge(hdata,unitowns,how='inner',on=['State','RegionName'])
    unitowns_hdata['uni'] = True
    hdata2 = pd.merge(hdata,unitowns_hdata,how='outer',on=['State','RegionName',bottom,bstart,'ratio'])
    hdata2['uni'] = hdata2['uni'].fillna(False)

    ut = hdata2[hdata2['uni'] == True]
    nut = hdata2[hdata2['uni'] == False]

    t,p = ttest_ind(ut['ratio'].dropna(),nut['ratio'].dropna())
    
    different = True if p < 0.01 else False

    better = "non-university town" if ut['ratio'].mean() < nut['ratio'].mean() else "university town"

    return different, p, better

run_ttest()

(True, 0.0020996596579520525, 'university town')

In [511]:
bottom_of_recession = get_recession_bottom()
data_to_quarter = convert_housing_data_to_quarters()
state_town_df = get_list_of_university_towns()
start_of_recession = get_recession_start()

new_start = data_to_quarter.columns[data_to_quarter.columns.get_loc(start_of_recession) -1]
data_to_quarter['Ratio'] = data_to_quarter[bottom_of_recession] - data_to_quarter[new_start]
data_to_quarter = data_to_quarter[['Ratio', bottom_of_recession, new_start]]
data_to_quarter.reset_index(inplace=True)
merge_state_town_df_data_to_quarter = pd.merge(state_town_df, data_to_quarter,on=['State','RegionName'],how='inner')
merge_state_town_df_data_to_quarter['merge_uni'] = True
# merge_state_town_df_data_to_quarter
new_merge_data_to_quarter_2 = pd.merge(merge_state_town_df_data_to_quarter, data_to_quarter,on=['State','RegionName','Ratio',new_start,bottom_of_recession],how='outer')

new_merge_data_to_quarter_2['merge_uni'].fillna(False, inplace=True)
# new_merge_data_to_quarter_2

true_merge_uni = new_merge_data_to_quarter_2[new_merge_data_to_quarter_2['merge_uni']==True]
false_merge_uni =new_merge_data_to_quarter_2[new_merge_data_to_quarter_2['merge_uni']==False]


t_dropna = true_merge_uni['Ratio'].dropna()
p_dropna = false_merge_uni['Ratio'].dropna()


test_t,test_p = ttest_ind(t_dropna, p_dropna)
# (p_dropna)
diff = True if test_p < 0.01 else False

who_is_better = "non-university town" if true_merge_uni['Ratio'].mean() < false_merge_uni['Ratio'].mean() else "university town"
test_p

0.0020996596579520525

In [470]:
new_start = data_to_quarter.columns[data_to_quarter.columns.get_loc(start_of_recession) -1]
# data_to_quarter['2008q2']
new_start

'2008q2'

In [469]:
data_to_quarter.columns[33]

'2008q2'